Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.StructuralSectionsService
The external service supporting view and modification of the structural sections shape in structural elements.
The service is still under development and cannot be used. It means that no server can be external registered from it yet.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SiteLinkerUIService
The external UI service Id which permits registration of an alternate servers for new ui of link topography

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.SiteInsertService
The external service which permits registration of an alternate implementation for Site insert.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipePressureDropService
The external service which permits registration of an alternate implementation for pipe pressure drop calculation.
To use this service, programmers implement a server class that derives from IPipePressureDropServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipePlumbingFixtureFlowService
The external service which permits registration of an alternate implementation for pipe fixture flow calculation.
To use this service, programmers implement a server class that derives from IPipePlumbingFixtureFlowServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFrictionFactorService
Pipe friction factor service id

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropUIService
The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI.
To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropUIServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.PipeFittingAndAccessoryPressureDropService
The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation.
To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.NavisworksExporterService
The external service which supports export of the model to Navisworks.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ModifyConnectionParametersService
The external service to view and modify structural connection parameters.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.MemberForcesService
The external service supporting view and modification of the member forces in analytical elements.
The service is still under development and cannot be used. It means that no server can be external registered from it yet.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCImporterService
The external service which permits registration of an alternate implementation for IFC import.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.IFCExporterService
The external service which permits registration of an alternate implementation for IFC export.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.FramingProfileService
The external service responsible for the generation of the fabrication profile.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalResourceUIService
The external UI service Id which permits registration of an alternate servers for managing error messages
which happen at the loading of the references to external resources such as linked files.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ExternalResourceService
The external service Id which permits registration of an alternate servers for managing external resources such as linked files.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.EntitlementExternalService
The external service which supports get entitlement information.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctPressureDropService
The external service which permits registration of an alternate implementation for duct pressure drop calculation.
To use this service, programmers implement a server class that derives from IDuctPressureDropServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropUIService
The external service which permits registration of an alternate implementation for a duct fitting and accessory pressure drop calculation UI.
To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropUIServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DuctFittingAndAccessoryPressureDropService
The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation.
To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.DirectContext3DService
The external service that provides the facility to draw externally specified geometry in a Revit view in a way that is conceptually similar to a low-level graphics API.
To use this service, programmers implement a server class that derives from Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ConnectionTypeChangedService
The external service used to notify when structural connection changed the type.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CodeCheckingParameterService
The external service supporting view and modification of the structural code checking parameter in analytical elements.
To use this service, programmers implement a server class that derives from ICodeCheckingParameterServer.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CloudExternalService
The external service which supports get cloud model information from cloud servers such as C4R.

Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices
A collection of ids for external services that are managed and used by Revit directly.